Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: This wizard helps you modify the settings for a web project space.
cy: Mae'r dewin yma yn eich cynorthwyo i newid y gosodiadau ar gyfer lle project gwe.

source: This dialog allows you to reassign a task.
cy: Mae'r deialog yma yn eich caniatáu i ail-neilltuo tasg.

source: Check Links
cy: Gwirio Cysylltiadau

source: Manage Multilingual Content
cy: Rheoli Cynnwys Amlieithog

source: Related Translations
cy: Cyfieithiadau Perthnasol

source: Set Values and Add
cy: Gosod Gwerthoedd ac Ychwanegu

source: Details View
cy: Golwg Manylion

source: Select the style of layout for your dashboard. Changing your existing dashboard layout to another with less columns will result in the additional columns being removed.
cy: Dewiswch cynllun i'ch gwibfwrdd. Bydd newid eich cynllun cyfredol i un gyda llai colofnau yn achosi i'r colofnau ychwanegol cael eu colli.

source: Uploaded File Details
cy: Manylion y Ffeil Wedi ei Lwytho i Fyny

source: Manage Space Users
cy: Rheoli Defnyddwyr Lle

source: No results
cy: Dim canlyniadau

source: Failed to execute import: {0}
cy: Methwyd gweithredu'r mewnforyn: {0}

source: Please ensure that both password fields contain the same value.
cy: Sicrhewch bod yr un gwerth yn y ddau maes cyfrinair.

source: Recover
cy: Adfer

source: View Details
cy: Gweld Manylion

source: Step Three - Space Details
cy: Cam Tri - Manylion y Lle

source: Check out file
cy: Gwirio allan ffeil

source: Enter information about the new space then click Create Space.
cy: Mewnbynnwch gwybodaeth am y lle newydd a chliciwch Creu Lle.

source: No posts to display. Click the ''Post to Topic'' action to create a post.
cy: Dim pyst i arddangos. Cliciwch y weithred "Postio i Bwnc" i greu post.

source: The document will be {0} to ''{1}'' if the ''{2}'' action is taken.
cy: Bydd y dogfen yn cael ei {0} i "{1}" os gymerir y gweithred "{2}".

source: Step Four - Configure Web Content Forms
cy: Cam Pedwar - Ffurfweddu Ffurflenni Cynnwys Gwe

source: Run Action Wizard
cy: Dewin Rhedeg Gweithred

source: Selected Components
cy: Cydrannau Dewiswyd

source: Look for
cy: Edrychwch am

source: To execute the action click Finish. To review or change your selections click Back.
cy: I rhedeg y gweithred cliciwch Gorffen. I adolygu neu i newid eich dewisiadau, cliciwch Nôl.

source: Task Pool
cy: Pwll Tasgau

source: Select Templates
cy: Dewiswch Templedi

source: Locate and upload your document to the repository.
cy: Lleoli a fyny-llwytho eich dogfen i'r repositori.

source: Deploy Sandbox Changes
cy: Darparu Newidiadau Blwch Tywod

source: Password
cy: Cyfrinair

source: Show All Web Projects
cy: Dangos Pob Project Gwe

source: Finish
cy: Gorffen

source: Saved Search Properties
cy: Priodweddau Chwiliad a Cadwyd

source: Upload Content
cy: Llwytho i Fyny Cynnwys

source: Action
cy: Gweithred

source: Content
cy: Cynnwys

source: All Active Tasks
cy: Pob Tasg Gweithredol

source: Public Searches
cy: Chwiliadau Cyhoeddus

source: User Sandboxes
cy: Blychau Tywod Defnyddwyr

source: Translation title
cy: Teitl cyfieithiad

source: This space is not part of any advanced workflows.
cy: Nid yw'r lle yn rhan o unrhyw llifiau gwaith uwch.

source: Locale
cy: Lleoleiddiad

source: Options
cy: Dewisiadau

source: Select the workflow you want to be used by default for form {0}.
cy: Dewiswch y llif gwaith bydd yn cael ei ddefnyddio'n rhagosodedig gan y ffurflen {0}.

source: Alfresco Web Client - System Error
cy: Dibynnydd Gwe Alfresco - Gwall System

source: Create Reply
cy: Creu Ateb

source: This wizard helps you to add a user to the repository.
cy: Mae'r dewin yma yn eich cynorthwyo i ychwanegu defnyddiwr i'r repositori.

source: Attempt Date
cy: Dyddiad Cais

source: The User will no longer be able to access the system. Are you sure you want to delete user "{0}"?
cy: Ni fydd y defnyddiwr yn gallu cyrchu'r system bellach. A ydych chi'n siŵr eich bod eisiau dileu'r defnyddiwr "{0}"?

source: Edit Rule Wizard
cy: Dewin Golygu Rheol

source: Run rule in background
cy: Rhedeg rheol yn y cefndir

source: Created Date
cy: Dyddiad Creu

source: Decreases the size of the scrollable area by 100px (to a minimum of 100px)
cy: Lleiha'r maint yr ardal graddadwy gan 100 picseli (i maint lleiaf o 100 picseli)

source: Modify User Roles for
cy: Newid Rolau Defnyddwyr ar gyfer

source: Failed to find any registered OpenSearch engines!
cy: Methwyd canfod unrhyw peiriannau OpenSearch cofrestredig!

source: Select the template you want to use.
cy: Dewis y templed rydych am ei defnyddio

source: Submit Selected
cy: Cyflwyno Dewiswyd

source: Available Components
cy: Cydrannau Ar Gael

source: This document has no version history.
cy: Nid oes hanes fersiwn gan y ddogfen

source: Cookies must be enabled in your browser for the Alfresco Web-Client to function correctly.
cy: Rhaid galluogi cwcis yn eich porwr er mwyn i'r Dibynnydd Gwe Alfresco gweithio'n gywir.

source: Content Details
cy: Manylion Cynnwys

source: Content Contributor
cy: Cyfrannwr Cynnwys

source: Successfully reverted {1,choice,0#SHOULD_NOT_HAPPEN|1#item|1<items}: {0}
cy: Dychwelwyd yr {1,choice,0#SHOULD_NOT_HAPPEN|1#eitem|1<eitemau} yn llwyddiannus: {0}

source: My Sandbox
cy: Fy Mlwch Tywod

source: Recover an item from the deleted file store
cy: Adfer eitem o'r stôr ffeiliau wedi'u dileu

source: Send email to ''{0}''
cy: Anfon e-bost i "{0}"

source: Item is a subtype of ''{0}''
cy: Eitem yn is-math o "{0}"

source: Alfresco content package
cy: Pecyn cynnwys Alfresco

source: Summary
cy: Crynodeb

source: Link Validation
cy: Dilysiant Cysylltiadau

source: This view allows you to browse the items in this space.
cy: Mae'r golwg yma yn eich caniatáu i bori'r eitemau yn y lle yma.

source: ''{0}'' was uploaded successfully.
cy: Llwythwyd "{0}" i fyny yn llwyddiannus

source: Select the servers to deploy to and click OK.
cy: Dewiswch y gweinyddion i ddarparu i a chiciwch Iawn.

source: Select role
cy: Dewis rôl

source: Succeeded
cy: WEDI LLWYDO

source: Show All
cy: Dangos Pob Un

source: Import
cy: Mewnforio

source: Collaborator
cy: Cydgyfansoddwr

source: Check Out Action
cy: Gweithred Gwirio Allan

source: Successfully submitted sandbox for user: {0}
cy: Cyflwynwyd y blwch tywod ar gyfer y defnyddiwr {0} yn llwyddiannus

source: Lock
cy: Cloi

source: Modify the topic properties then click OK.
cy: Newidiwch priodweddau'r pwnc a chliciwch Iawn.

source: Web Project Bulk Import
cy: Swmp-Mewnforiant Project Gwe

source: Step Two - Configure Deployment Servers
cy: Cam Dau - Ffurfweddu Gweinyddion Darpariaeth

source: Show me results for
cy: Dangos i mi canlyniadau ar gyfer

source: Failed to create new space due to error: {0}
cy: Methwyd creu lle newydd oherwydd gwall:

source: Details Page URL
cy: Cyfeiriad Tudalen Manylion

source: Create Post
cy: Creu Post

source: Template
cy: Templed

source: No resources found.
cy: Heb ganfod adnoddau

source: Edit the content of the file.
cy: Golygwch cynnwys y ffeil.

source: This wizard helps you configure your dashboard layout and contents
cy: Mae'r dewin yma yma yn eich cynorthwyo i ffurfweddu gosodiad a chynnwys eich gwibfwrdd

source: moved
cy: wedi symud

source: The test server ''{0}'' is allocated to this sandbox. To preview the current deployment click the preview link below (if a URL has been provided) or to deploy the latest changes click the OK button.
cy: Neilltuwyd y gweinydd profi "{0}" i'r blwch tywod. I ragolygu'r darpariaeth cyfredol cliciwch y cyswllt rhagolygu isod (os mae URL wedi'i benodi) neu i ddarparu'r newidiadau diweddaraf cliciwch Iawn.

source: Step Two - User Properties
cy: Cam Dau - Manylion Defnyddiwr

source: Username
cy: Enw Defnyddiwr

source: Unable to delete File due to system error:
cy: Methu dileu'r Ffeil oherwydd gwall system:

source: To save the message click Post.
cy: I gadw'r neges cliciwch Postio.

source: Edit the properties of the folder then click OK.
cy: Golygwch priodweddau'r ffolder a chliciwch Iawn.

source: Add aspect ''{0}''
cy: Ychwanegu agwedd "{0}"

source: Displays helpful information for getting started with the Alfresco web-client
cy: Dangosir gwybodaeth cynorthwyol i gychwyn gyda'r dibynnydd gwe Alfresco

source: Select space options.
cy: Dewiswch dewisiadau lle.

source: A place for keeping and organizing documents and other spaces.
cy: Lle i gadw a trefnu dogfennau a lleoedd arall.

source: Select the components for your dashboard and add them to the columns.
cy: Dewiswch cyfansoddion eich gwibfwrdd ac ychwanegwch nhw i'r colofnau.

source: Create a snaphost of this sandbox.
cy: Creu ciplun o'r blwch tywod yma

source: Display Name
cy: Enw Dangos

source: Email Alias
cy: Ffugenw E-bost

source: Select the Web Form to use for {0}.
cy: Dewis y Ffurflen Gwe i ddefnyddio ar gyfer {0}.

source: Copies content to ''{0}'' and transforms to ''{1}''
cy: Copïo cynnwys i "{0}" a thrawsffurfio i "{1}"

source: Item does not have a mimetype of ''{0}''
cy: Math MIME "{0}" nid gan yr eitem

source: From the toolbar click My Home to display a list of items in the space.
cy: Yn y bar offer cliciwch Fy Nghartref i ddangos rhestr o'r eitemau yn y lle.

source: Select Web Forms
cy: Dewiswch Ffurflenni Gwe

source: Selecting a new home space for a user will not remove the existing permissions on the original home space. You may wish to use the Manage Space Users dialog to modify permissions if they are no longer required on the original home space.
cy: Ni fydd dewis lle cartref newydd yn tynnu unrhyw caniatadau cyfredol ar y lle cartref gwreiddiol. Efallai hoffech chi defnyddio'r deialog Rheoli Defnyddwyr Lle i dynnu unrhyw caniatadau sydd ddim angen bellach.

source: My Checked Out Documents
cy: Fy Nogfennau Wedi Gwirio Allan

source: User Options
cy: Dewisiadau Defnyddiwr

source: ZIP file contains high-byte filename characters such as Japanese, Chinese or Korean.
cy: Ffeil ZIP yn cynnwys nodau enw ffeil beit-uwch fel Japaneg, Tsieinëeg neu Gorëeg.

source: Recover All Items
cy: Adfer Pob Eitem

source: Modify the simple workflow properties then click OK.
cy: Golygwch priodweddau y llif gwaith syml a chliciwch Iawn.

source: Are you sure you want to delete category "{0}" and all sub-categories?
cy: A ydych chi'n siŵr eich bod eisiau dileu'r categori "{0}" a'i holl is-gategorïau?

source: I want to...
cy: Rwyf eisiau...

source: A group ID with the same name already exists, group identifiers must be unique.
cy: Mae ID grŵp gyda'r un enw yn bodoli eisoes, rhaid i dynodiadau grŵp bod yn unigryw.

source: View details about the file.
cy: Gweld manylion am y ffeil.

source: Alfresco Store Browser
cy: Porwr Stôr Alfresco

source: Edit Link Properties
cy: Golygu Priodweddau Cyswllt

source: click to edit
cy: cliciwch i olygu

source: Inherited
cy: Etifeddedig

source: Null characterset value
cy: Gwerth set nodau nwl

source: Alfresco Node Reference
cy: Cyfeiriant Nôd Alfresco

source: View the details about the link object.
cy: Gweld manylion am y gwrthrych cyswllt.

source: More...
cy: Mwy...

source: Priority
cy: Blaenoriaeth

source: Failed to restore saved search due to error: {0}
cy: Methwyd adfer chwiliad a gadwyd oherwydd gwall: {0}

source: Are you sure you want to remove the user sandbox "{0}" from the Web Project?
cy: A ydych chi'n siŵr eich bod eisiau gwaredu'r blwch tywod "{0}" o'r Project Gwe?

source: Create Web Project
cy: Creu Project Gwe

source: Enter information about this user.
cy: Mewnbynnwch gwybodaeth am y defnyddiwr yma.

source: Bulk Import
cy: Swmp-Mewnforio

source: Content Rules
cy: Rheolau Cynnwys

source: Search by Content
cy: Chwilio Cynnwys

source: Selected Users
cy: Defnyddwyr Dewiswyd

source: Area that includes the clipboard, recent space and shortcuts
cy: Ardal sy'n cynnwys y clipfwrdd, lleoedd diweddaraf a llwybrau byr

source: IN PROGRESS
cy: AR WAITH

source: Specify Users/Groups and their roles
cy: Penodi Defnyddwyr/Grwpiau a'u rolau

source: Back
cy: Nôl

source: Delete All Deploy Reports
cy: Dileu Pob Adroddiad Darpariaeth

source: View the details about the content.
cy: Gweld manylion am y cynnwys.

source: Context
cy: Cyd-destun

source: Home Space Name
cy: Enw Lle Cartref

source: Note: If you can only see one type of space then other space types may not be enabled. See your System Administrator for further help.
cy: Os welwch ond un math o lle efallai nad yw unrhyw mathau eraill wedi eu alluogi. Gwelwch eich Gweinyddwr System am gymorth pellach.

source: Edit Web Project Wizard
cy: Dewin Golygu Project Gwe

source: Selected Workflows
cy: Llifiau Gwaith Dewisedig

source: View in WebDAV
cy: Gweld mewn WebDAV

source: User Details
cy: Manylion Defnyddiwr

source: Cancel the check out of a document and discard any changes.
cy: Diddymu y gwiriad allan o ddogfen a gwaredu unrhyw newidiadau.

source: Alfresco Web Client - Logged Out
cy: Dibynnydd Gwe Alfresco - Allgofnodwyd

source: Failed to update category due to system error: {0}
cy: Methwyd diweddaru'r categori oherwydd gwall system: {0}

source: Regenerate Renditions Wizard
cy: Dewin Ail-gynhyrchu Lluniadau

source: Are you sure you want to recover the following deleted files and spaces from the deleted file store?
cy: A ydych chi'n siŵr eich bod eisiau adfer y ffeiliau a lleoedd dilynol o'r stôr ffeiliau wedi'u dileu?

source: Generating links report, please wait...
cy: Cynhyrchu adroddiad cysylltiadau, arhoswch, os gwelwch yn dda...

source: Displays a list of the documents in my home space
cy: Dangosir rhestr o'r dogfennau yn fy lle cartref

source: Web Form
cy: Ffurflen

source: This layout displays components in a single column the full width of the page
cy: Mae'r cynllun yma yn arddangos cydrannau mewn un colofn lled llawn y dudalen

source: To start the workflow press Finish. To review or change your selections click Back.
cy: I gychwyn y llif gwaith cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Security
cy: Diogelwch

source: Modified Date
cy: Dyddiad Newidiwyd

source: Select Users to add to this Group
cy: Dewis Defnyddwyr i ychwanegu i'r Grŵp yma

source: Next Page
cy: Tudalen Nesaf

source: Other Options
cy: Dewisiadau Eraill

source: Failed to find association definition for association "{0}".
cy: Methwyd canfod diffiniad cysylltiad ar gyfer y cysylltiad "{0}".

source: RSS Template
cy: Templed RSS

source: Create Snapshot
cy: Creu Ciplun

source: Shows a summary of the information entered.
cy: Dangos crynodeb o'r gwybodaeth a roddwyd

source: Simple Workflow
cy: Llif Gwaith Syml

source: To remove this forum space and its contents, click OK.
cy: I gwaredu'r lle fforwm yma a'i cynnwys, cliciwch Iawn.

source: Conditions
cy: Amodau

source: Select a template to be applied to the Space as an RSS feed.
cy: Dewiswch templed i osod i'r lle fel porthiant RSS

source: Add Content Dialog
cy: Deialog Ychwanegu Cynnwys

source: Cancel Workflow
cy: Diddymu Llif Gwaith

source: Type
cy: Math

source: Link Category Action
cy: Gweithred Cysylltu Categori

source: Item has a mimetype of ''{0}''
cy: Math MIME "{0}" gan yr eitem

source: Copy of
cy: Copi o

source: Run Action
cy: Rhedeg Gweithred

source: Step One - Web Project Details
cy: Cam Un - Manylion Project Gwe

source: Website ''{0}'' sandbox ''{1}''
cy: Safle gwe "{0}" blwch tywod "{1}"

source: Re-login to Alfresco
cy: Ail-mewngofnodi i Alfresco

source: Groups
cy: Grwpiau

source: Help
cy: Cymorth

source: What do you want to delete?
cy: Beth hoffech chi dileu?

source: {0} Generated Files
cy: {0} Ffeiliau Wedi Cynhyrchu

source: Regenerated {0} {0,choice,0#renditions|1#rendition|1<renditions}.
cy: Wedi ail-gynhyrchu {0} {0,choice,0#lluniadau|1#lluniad|1<lluniadau}

source: Where do you want to keep the copy of this file?
cy: Lle ydych eisiau cadw y copi o'r ffeil yma?

source: All Spaces
cy: Pob Lle

source: Not enough information was entered to perform a search, at least one value must be entered or a location selected to search within. Text fields require a minimum of {0} characters.
cy: Ni roddwyd digon o wybodaeth i berfformio chwiliad, rhaid penodi o leiaf un gwerth neu leoliad i chwilio y tu fewn. Mae meysydd testun angen o leiaf {0} nodau.

source: Creator
cy: Crëwr

source: Add a translation to this document
cy: Ychwanegu cyfieithiad i'r dogfen yma

source: Forum Properties
cy: Priodweddau Fforwm

source: Choose the layout and number of columns for your dashboard.
cy: Dewiswch y gosodiad a'r nifer o golofnau i'ch gwibfwrdd.

source: {0} must be between {1} and {2}.
cy: Rhaid i {0} fod rhwng {1} a {2}

source: When the download is complete, click OK.
cy: Pan mae'r lawrlwythiad yn gyflawn, cliciwch Iawn.

source: Link to category ''{0}''
cy: Cysylltu i gategori "{0}"

source: Alfresco Web Client
cy: Dibynnydd Gwe Alfresco

source: Click here to select a Space
cy: Cliciwch yma i ddewis Lle

source: Select which renditions you want to regenerate within the selected web project.
cy: Dewis y lluniadau eich bod eisiau ail-gynhyrchu yn y project gwe dewiswyd.

source: Copy to ''{0}''
cy: Copïo i "{0}"

source: Name for reject step
cy: Enw i'r cam gwrthod

source: Item is not a subtype of ''{0}''
cy: Eitem ddim yn is-math o "{0}"

source: Folder Details
cy: Manylion Ffolder

source: No topics to display. Click the ''Create Topic'' action to create a topic.
cy: Dim pynciau i ddangos. Cliciwch y gweithred "Creu Pwnc" i greu pwnc.

source: Change Password
cy: Newid Cyfrinair

source: is an invalid character.
cy: yn nod annilys

source: {0} not found in {1}.
cy: {0} dim wedi canfod mewn {1}.

source: Delete Folder
cy: Dileu Ffolder

source: An error occurred during the link validation check
cy: Digwyddodd gwall yn ystod y gwiriad dilysu cysylltiadau

source: The Identifier for a Group cannot be changed once it has been set.
cy: Ni allwch dynodwr y grŵp newid ar ôl ei osod.

source: Filename pattern match
cy: Cydweddiad patrwm enw ffeil

source: My Completed Tasks
cy: Fy Nhasgau a Gwblhawyd

source: Edit Web Content Wizard
cy: Dewin Golygu Cynnwys Gwe

source: Enter information about the new Category then click Create Category.
cy: Mewnbynnwch gwybodaeth am y Categori newydd a chliciwch Creu Categori

source: Staging Sandbox
cy: Blwch Tywod Llwyfo

source: Space Options
cy: Dewisiadau Lle

source: Topics
cy: Pynciau

source: Recover all files and spaces from the deleted file store
cy: Adfer pob ffeil a lle o'r stôr ffeiliau wedi'u dileu?

source: Port
cy: Porth

source: Browse items in your home space
cy: Pori eitemau yn eich lle cartref

source: Email Users
cy: Anfon E-bost i Defnyddwyr

source: The following items failed to recover
cy: Methwyd adfer yr eitemau dilynol

source: Rendering Engine Templates
cy: Templedi Peiriant Llunio

source: Toggle Options
cy: Toglu Dewisiadau

source: Users and Groups
cy: Defnyddwyr a Grwpiau

source: Perform a more detailed search of the repository.
cy: Perfformiwch chwiliad mwy manwl o'r repositori

source: Clear
cy: Clirio

source: Modify the forum space properties then click OK.
cy: Newidiwch priodweddau'r lle fforwm a chliciwch Iawn.

source: Choose this option to regenerate particular renditions generated by a particular set of rendering engine templates.
cy: Dewiswch y dewisiad yma i ail-gynhyrchu lluniadau penodol o gynnwys a gynhyrchwyd gan templedi peiriant llunio penodol.

source: Show Last Deployment Report
cy: Dangos Adroddiad Darpariaeth Diweddaraf

source: Undo All
cy: Dadwneud Pob Un

source: Post
cy: Postio

source: Workflow Settings
cy: Gosodiadau Llif Gwaith

source: This layout can display {0} components
cy: Gall y cynllun yma ymddangos {0} o gydrannau

source: View the details about the space.
cy: Gweld manylion y lle

source: From
cy: O

source: Paste Item
cy: Gludo Eitem

source: Enter your new password.
cy: Mewnbynnwch eich cyfrinair newydd

source: Configure Web Forms
cy: Ffurfweddu Ffurflenni Gwe

source: Forum Details
cy: Manylion Fforwm

source: Are you sure you want to delete the web project "{0}" and all associated user sandboxes?
cy: A ydych chi'n siŵr eich bod eisiau dileu'r project gwe "{0}" a pob blwch tywod defnyddiwr cysylltiedig?

source: Email message
cy: Neges e-bost

source: The space will be {0} to ''{1}'' if the ''{2}'' action is taken.
cy: Bydd y lle yn cael ei {0} i "{1}" os gymerir y gweithred "{2}".

source: Preview of
cy: Rhagolwg o

source: An item was added to the clipboard. There are now {0} item(s) in the clipboard. To paste all collected items navigate to the desired space then from the menu under ''More Actions'' select ''Paste All''.
cy: Ychwanegwyd eitem i''r clipfwrdd. Mae yna nawr {0,choice,0#SHOULD_NOT_HAPPEN|1#un eitem|1<{0,number} eitemau} yn y clipfwrdd. I gludo pob eitem a gasglwyd llywio i''r lle dymunol a wedyn dewiswch "Gludo Pob Un" o''r dewislen o dan "Mwy o Gweithredoedd".

source: Content Manager
cy: Rheolwr Cynnwys

source: Delete All Items
cy: Dileu Pob Eitem

source: Working copy for
cy: Copi gweithio ar gyfer

source: Create a new edition using
cy: Creu argraffiad newydd gan ddefnyddio

source: Manage Content Users
cy: Rheoli Defnyddwyr Cynnwys

source: Create Space Wizard
cy: Dewin Creu Lle

source: Browse View
cy: Golwg Pori

source: Enter information about the check out.
cy: Mewnbynnwch gwybodaeth am y gwiriad allan.

source: Topic Details
cy: Manylion Pwnc

source: Add Users
cy: Ychwanegu Defnyddwyr

source: Add
cy: Ychwanegu

source: Set
cy: Gosod

source: This view allows you to see all items in this category
cy: Mae'r golwg yma yn eich caniatáu i weld pob eitem yn y categori yma

source: Administrator
cy: Gweinyddwr

source: Setup the Templates you want to use for the Web Form {0} in Web Project {1}.
cy: Gosod y Templedi rydych am eu defnyddio gyda Ffurflen Gwe {0} yn y Project Gwe {1}.

source: Selected roles
cy: Rolau dewiswyd

source: New Edition Wizard
cy: Dewin Argraffiad Newydd

source: Select...
cy: Dewis...

source: New Category
cy: Categori Newydd

source: Unable to cancel check out of Content Node due to system error:
cy: Methu diddymu gwiriad allan y Nôd Cynnwys oherwydd gwall system:

source: Configure Workflow
cy: Ffurfweddu Llif Gwaith

source: FAILED
cy: METHWYD

source: Recovery Report
cy: Adroddiad Adferiad

source: Include this Space
cy: Cynnwys y Lle Yma

source: Failed to recover the item "{0}" as you do not have the appropriate permissions to restore the item to the parent folder, please select a new folder destination.
cy: Methwyd adfer yr eitem "{0}" oherwydd ni oes gennych y caniatadau angenrheidiol ar y ffolder rhiant. Dewiswch cyrchfan arall, os gwelwch y dda.

source: Item with same name exists
cy: Eitem gyda'r un enw yn bodoli

source: Contains Text Condition
cy: Amod Cynnwys Testun

source: Are you sure you want to permanently delete "{0}"? This document will not be recovered.
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" am byth? Ni allir adfer y dogfen yn nes ymlaen.

source: Only the files within this space.
cy: Ffeiliau yn y lle yma yn unig.

source: Do you want to apply a default workflow now?
cy: Ydych chi eisiau gosod llif gwaith rhagosodedig rŵan?

source: Add File System Receiver (FSR)
cy: Ychwanegu Derbyniwr System Ffeil (FSR)

source: Description
cy: Disgrifiad

source: Unable to add a translation.
cy: Methu ychwanegu cyfieithiad.

source: Shared Folder
cy: Ffolder Rhanedig

source: Delete Topic
cy: Dileu Pwnc

source: This wizard helps you create a new rule.
cy: Mae'r dewin yma yn eich cynorthwyo i greu rheol newydd.

source: My Alfresco Dashboard
cy: Fy Ngwibfwrdd Alfresco

source: no workflow
cy: dim llif gwaith
